Repository: SudoSu-bham/typing-turtle-activity
Catalog: po/*.po
Languages: fr, ne_np

source: Typing Turtle
fr: Tortue dactylo
ne_np: टाईपीङ्ग टर्टल

source: Need some help typing? Here you will learn the best way to hold your hands in order for you to become a faster typist!
fr: Besoin d'aide pour taper au clavier ? Ici vous apprendrez la meilleure façon de tenir vos mains pour taper encore plus vite !

source: Go Back
fr: Retourner
ne_np: पछाडी

source: You finished!
fr: Tu as terminé !
ne_np: तिमीले सकायौ !

source: Your score was %(score)d.
fr: Ton score est %(score)d.
ne_np: तिम्रो अंक %(score)d हो ।

source: You earned a %(type)s medal!
fr: Tu as gagné une médaille %(type)s !
ne_np: तिमीले %(type)s पदक कमायौ !

source: Press the ENTER key to continue.
fr: Appuie sur ENTRÉE (ENTER) pour continuer.
ne_np: अघि बढ्नको लागि एन्टर कि थिच

source: Type the words to pop the balloons!
fr: Tape les mots pour faire éclater les ballons !
ne_np: फुकुना फुटाउनको लागि शब्द टाईप गर !

source: Edit Lessons
fr: Éditer les leçons

source: Name
fr: Nom

source: Import Lessons from Journal
fr: Importer les leçons du Journal

source: Export Lessons to Journal
fr: Exporter les leçons vers le Journal

source: Save Lessons to Activity
fr: Enregistrer les leçons vers l'activité

source: Text
fr: Texte

source: Balloon Game
fr: Jeu ballons

source: Delete Lesson?
fr: Effacer la leçon ?

source: Deleting the lesson will erase the lesson content.
fr: La suppression de la leçon supprime le contenu de la leçon.

source: (Exported Lessons)
fr: (leçons exportées)

source: Edit a Lesson
fr: Éditer une leçon

source: New keys
fr: Nouvelles touches

source: Known keys
fr: Touches connues

source: Length
fr: Longueur

source: Generate!
fr: Générer

source: Edit Word List
fr: Éditer la liste des mots

source: Step #%d
fr: Étape #%d

source: Keys
fr: Touches

source: Words
fr: Mots

source: Accuracy
fr: Précision

source: WPM
fr: MPM

source: Lesson Details
fr: Détails de la leçon

source: Normal Lesson
fr: Leçon normale

source: Allow Mistakes
fr: Autoriser les erreurs

source: Allow Backspace
fr: Autoriser la touche retour

source: Automatic Lesson Generator
fr: Générateur automatique de leçon

source: Medal Requirements
fr: Exigences de la médaille

source: Silver
fr: Argent

source: Gold
fr: Or

source: Type or paste words here, for the Automatic Lesson Generator. If empty, the dictionary will be used.
fr: Tape ou colle les mots ici pour le Générateur automatique de leçon. S'il est vide, le dictionnaire sera utilisé.

source: Well done!
fr: Bravo !
ne_np: राम्रो गर्यौ

source: Good job.
fr: Bon travail.

source: Awesome!
fr: Génial !

source: Way to go!
fr: Continue !
ne_np: राम्रो

source: Wonderful!
fr: Fantastique !

source: Nice work.
fr: Pas mal !

source: You did it!
fr: Bien joué !

source: Be careful to use the correct finger to press each key. Look at the keyboard below if you need help remembering.
fr: Utilise le bon doigt pour presser sur chaque touche. Regarde le clavier ci-dessous si tu as besoin d'aide.

source: Try to type at the same speed, all the time. As you get more comfortable you can increase the speed a little.
fr: Essaye de taper à la même vitesse du début jusqu'à la fin. Tu pourras ensuite taper plus vite lorsque tu auras plus de pratique.

source: left little
fr: auriculaire gauche

source: left ring
fr: annulaire gauche

source: left middle
fr: médium gauche

source: left index
fr: index gauche

source: left thumb
fr: pouce gauche

source: right little
fr: auriculaire droit

source: right ring
fr: annulaire droit

source: right middle
fr: médium droit

source: right index
fr: index droit

source: right thumb
fr: pouce droit

source: and %s keys
fr: et touches %s

source: key
fr: touche

source: In this lesson, you will learn the %(keynames)s. Press the ENTER key when you are ready to begin!
fr: Tu apprendras au cours de cette leçon le %(keynames)s. Appuie sur la touche ENTRÉE (ENTER) pour commencer !

source: Let's learn the new keys.
fr: Apprenons les nouvelles touches.

source: Practice typing the keys you just learned.
fr: Exerce-toi avec les touches que tu viens d'apprendre.

source: Now put the keys together into pairs.
fr: Regroupe les touches par paires.

source: Time to type jumbles.
fr: Apprends à taper des lettres mélangées.

source: Time to type real words.
fr: Apprends à taper de vrais mots.

source: Hihowahyah! Ready to learn the secret of fast typing?
fr: Génial ! Paré pour découvrir comment taper vite au clavier ?
ne_np: के तिमीलाई छिटो टाईप गर्ने सिप सिक्न मन छ?

source: Always use the correct finger to press each key!
fr: Utilise toujours le doigt correct pour taper sur chaque touche !
ne_np: जहिलेपनी कि थिच्न ठिक औँला प्रयोग गर !

source: Now, place your hands on the keyboard just like the picture below.
fr: Place ensuite tes mains au-dessus du clavier comme indiqué ci-dessous.
ne_np: अब आफ्नो हात तलको पोटो मा देखाए जसरी किबोर्डमा राख ।

source: When you're ready, press the SPACE bar with your thumb!
fr: Lorsque tu es prêt, appuie sur la barre ESPACE avec ton pouce !
ne_np: तयार भएपछी बुढी औलाले SPACE BAR थिच !

source: Good job! The SPACE bar is used to insert spaces between words.
fr: Bravo ! La barre ESPACE permet d'insérer des espaces entre les mots.
ne_np: राम्रो ! SPACE BAR शब्दहरुको बिचमा खाली ठाउँ राख्नको लागी प्रयोग गरिन्छ ।

source: Press the SPACE bar again with your thumb.
fr: Appuie à nouveau sur la barre ESPACE avec le pouce.
ne_np: फेरी आफ्नो बुढी औलाले SPACE BAR थिच ।

source: Now I'll teach you the second key, ENTER.
fr: Maintenant, tu vas apprendre la touche ENTRÉE (ENTER).
ne_np: अब, म तिमीलाई दोस्रो कि सिकाउँछु, एन्टर ।

source: That's the big square key near your right little finger.
fr: C'est la grande touche carrée près de ton auriculaire droit.
ne_np: तयो भन्या तिम्रो दायाँ हातको कान्छी औँलाको नजिक को वर्ग हो।

source: Now, reach your little finger over and press ENTER.
fr: Approche to auriculaire de cette touche et appuie sur ENTRÉE (ENTER).
ne_np: अब तिम्रो दायाँ हातको कान्छी औँलाले एन्टर थिच ।

source: Great! When typing, the ENTER key is used to begin a new line.
fr: Parfait ! La touche ENTRÉE (ENTER) permet de commencer une nouvelle ligne.
ne_np: स्याबास ! टाईप गरिरहेको बेला एन्टर कि नयाँ लाईन सुरु गर्न प्रयोग गरिन्छ ।

source: Press the ENTER key again with your right little finger.
fr: Appuie à nouveau sur la touche ENTRÉE (ENTER) avec ton auriculaire droit.
ne_np: फेरि आफ्नो दायाँ हातको कान्छी औँलाले एन्टर थिच ।

source: Copy out the following text.
fr: Copie le texte suivant.

source: left little finger
fr: auriculaire gauche

source: left ring finger
fr: annulaire gauche

source: left middle finger
fr: médium gauche

source: left index finger
fr: index gauche

source: right little finger
fr: auriculaire droit

source: right ring finger
fr: annulaire droit

source: right middle finger
fr: médium droit

source: right index finger
fr: index droit

source: <b>WPM:</b> %(wpm)d
fr: <b>MAM :</b> %(wpm)d
ne_np: <b>शब्द प्रती मिनेट:</b> %(wpm)d

source: <b>Accuracy:</b> %(accuracy)d%%
fr: <b>Précision :</b> %(accuracy)d%%
ne_np: <b>शुद्धता:</b> %(accuracy)d%%

source: Press and hold the shift key with your %(finger)s,
fr: Maintiens la touche MAJ (SHIFT) enfoncée avec ton %(finger)s,

source: then press the %(letter)s key with your %(finger)s.
fr: Appuie ensuite sur la touche %(letter)s avec ton %(finger)s.

source: Press and hold the altgr key,
fr: Maintiens la touche ALTGR enfoncée,

source: Press and hold the altgr and shift keys,
fr: Maintiens les touches ALTGR et MAJ (SHIFT) enfoncées,

source: Press the %(letter)s key with your %(finger)s.
fr: Appuie sur la touche %(letter)s avec ton %(finger)s.

source: Uh oh! Your keyboard cannot type the letter '%s'.
fr: Attention ! Ton clavier ne peut pas taper la lettre '%s'.

source: Please change your keyboard settings and try this lesson again.
fr: Modifie les paramètres de ton clavier et réessaye cette leçon.

source: Good job!
fr: Bon travail !
ne_np: राम्रो काम !

source: Nice work!
fr: Félicitations !
ne_np: स्याबास

source: You finished the lesson in %(time)d seconds, with %(errors)d errors.
fr: Tu as terminé la leçon en %(time)d secondes, en faisant %(errors)d erreurs.
ne_np: तिमीले यो पाठ %(time)d सेकेन्डमा %(errors)d गलतीहरु गरेर सकायौ ।

source: Your words per minute (WPM) was %(wpm)d, and your accuracy was %(accuracy)d%%.
fr: Ta vitesse de frappe en mots à la minute (MPM) était de %(wpm)d et ta précision était de %(accuracy)d%%.
ne_np: तिम्रो शब्द प्रती मिनेट (श.प्र.मि) %(wpm)d र शुद्धता %(accuracy)d%% हो ।

source: You finished the lesson with %(errors)d errors.
fr: Tu as terminé la leçon avec %(errors)d erreurs.
ne_np: तिमीले यो पाठ %(errors)d गलती गरेर सकायौ ।

source: Your accuracy was %(accuracy)d%%.
fr: Ta précision était de %(accuracy)d%%.
ne_np: तिम्रो शुद्धता %(accuracy)d%% थियो ।

source: Congratulations! You earned a %(type)s medal!
fr: Félicitations ! Tu as gagné une médaille %(type)s !
ne_np: बधाई छ! तिमीले एकओटा %(type)s पदक जित्यौ !

source: You need to practice this lesson more before moving on.
fr: Tu a besoin de t'exercer avant de passer à la suite.
ne_np: तिमीले यो पाठको अझै अभ्यास गर्नु पर्छ ।

source: You almost got a medal! Next time, try not to make as many errors.
fr: Tu as presque gagné une médaille ! La prochaine fois, essaie de ne pas faire autant d'erreurs.
ne_np: तिमीले झण्डै पदक पयौ ! अर्को पटक धेरै गलतीहरु नगर ।

source: You almost got a medal! Next time, try to type a little faster.
fr: Tu as presque gagné une médaille ! La prochaine fois, essaie de taper un peu plus vite.
ne_np: तिमीले झण्डै पदक पयौ ! अर्को पटक छिटो टाईप गर्न प्रयास गर ।

source: Next
fr: Suivant
ne_np: अघि

source: Previous
fr: Précédent
ne_np: पछाडी

source: Start Lesson
fr: Commencer la leçon
ne_np: पाठ सुरु गर

source: You earned a medal in this lesson! Advance to the next one by clicking the Next button.
fr: Tu as gagné une médaille dans cette leçon ! Passe à la suivante en cliquant sur le bouton Suivant.
ne_np: तिमीले यो पाठमा एकओटा पदक कमायौ ! दाईने बटन थिचेर अर्को पाठ सुरु गर

source: No Medal Yet
fr: Tu n'as pas encore de médaille
ne_np: कुनै पदक छैन

source: Bronze Medal
fr: Médaille de bronze
ne_np: कास्य पदक

source: Silver Medal
fr: Médaille d'argent
ne_np: रजत पदक

source: Gold Medal
fr: Médaille d'or
ne_np: स्वर्ण पदक

source: <span font_desc='Serif Bold Italic 28'>Certificate of Achievement</span>
fr: <span font_desc='Serif Bold Italic 28'>Certificat de compétence</span>
ne_np: <span font_desc='Serif Bold Italic 28'>उपलब्धिको प्रमाणपत्र</span>

source: <span font_desc='Sans 16'>This certifies that</span>
fr: <span font_desc='Sans 16'>Ce document atteste que</span>
ne_np: <span font_desc='Sans 16'>यसले यो प्रमाण गर्छकी</span>

source: <span font_desc='Sans 16'>earned a %(type)s medal in </span>
fr: <span font_desc='Sans 16'>a obtenu une médaille %(type)s pour </span>
ne_np: <span font_desc='Sans 16'>ले एकओटा %(type)s पदक यो </span>

source: <span font_desc='Sans 16'>in <b><u><i>%(lesson)s</i></u></b></span>
fr: <span font_desc='Sans 16'>dans <b><u><i>%(lesson)s</i></u></b></span>
ne_np: <span font_desc='Sans 16'>in <b><u><i>%(lesson)s पाठमा</i></u></b></span>

source: <span font_desc='Sans 16'>on <b><u><i>%(date)s</i></u></b>.</span>
fr: <span font_desc='Sans 16'>le <b><u><i>%(date)s</i></u></b>.</span>
ne_np: <span font_desc='Sans 16'>on <b><u><i>%(date)s गते</i></u></b>.</span>

source: <b>Words Per Minute:</b> %(wpm)d
fr: <b>Mots à la minute :</b> %(wpm)d
ne_np: <b>शब्द प्रती मिनेट:</b> %(wpm)d

source: <b>SCORE:</b> %(score)d
ne_np: <b>अंक:</b> %(score)d

source: SCORE: %d
ne_np: अंक: %d
