Repository: SudoSu-bham/typing-turtle-activity
Catalog: po/nah.po
Languages: nah

source: Typing Turtle
nah: Koxwaltlajkuilojketl

source: Need some help typing? Here you will learn the best way to hold your hands in order for you to become a faster typist!
nah: ¿titlajkuilojtok tijneki palewilli ¡nikan welis tijyeekosTlen kenijki titlalijtos momax kiampa nelia timajmamijmatis

source: Go Back
nah: Xitlakuepa

source: You finished!
nah: ¡titlantok

source: Press the ENTER key to continue.
nah: Pacho makmachiotl TLATLAPOS mosentokilis

source: Type the words to pop the balloons!
nah: Makmachiotis tlajtolli ijkinon motoponis olijiyotl.

source: Edit Lessons
nah: Tlapowalli momiakchiwas

source: Name
nah: Tokaitl

source: Description
nah: Tejtempowalli

source: Type
nah: Sentlaman

source: Import Lessons from Journal
nah: Tlen nochipa tlaixpowalli teaxkaselis

source: Export Lessons to Journal
nah: Tlen nochipa tlaixpowalli teaxkamakas

source: Save Lessons to Activity
nah: Tlachiwalixpowalli moajokuis

source: Text
nah: Nejtolli

source: Delete Lesson?
nah: ¿Tlaixpowalpolos?

source: Deleting the lesson will erase the lesson content.
nah: Keman tikixpolos tlaixpolwallli titlamitlixpolos

source: (Exported Lessons)
nah: (tlaixpowalli teaxkayotl)

source: Edit a Lesson
nah: Tlaixpowalmiakilli

source: New keys
nah: Yankuik mamachiotl

source: Known keys
nah: Tlen moyeekoj mamachiotl

source: Length
nah: Iweweyaka

source: Generate!
nah: ¡momiakilis!

source: Edit Word List
nah: Momiakilis tekpanpobras

source: Keys
nah: Mamachiotl

source: Words
nah: Tlajtlajtolli

source: Instructions
nah: Tekpanmatilli

source: Accuracy
nah: Melaktli

source: WPM
nah: PPM

source: Score
nah: Tijtsipinilli

source: Lesson Details
nah: Iyojyoka tlaixpowalli

source: Normal Lesson
nah: Melawak tlaixpowalli

source: Options
nah: Tlajtlamatilli

source: Allow Mistakes
nah: Moselis nekuapololli

source: Allow Backspace
nah: Ma tlakuepilli

source: Automatic Lesson Generator
nah: Tlapijpitsa ixpowalli iselli

source: Medal Requirements
nah: Tlen monejneki ipan koskamachiotl

source: Bronze
nah: Bronce

source: Silver
nah: Istakkuitlatl

source: Gold
nah: Teokuitlatl

source: Type or paste words here, for the Automatic Lesson Generator. If empty, the dictionary will be used.
nah: Xikijkuilo o xitlatskilti tlajtolli nikan moaxkatis tlapijpitsa ixpowallli iselli. Tlan ni tijkawas, motekiwis tlajtoltémolistli.

source: Well done!
nah: kualtlachiwalli!

source: Good job.
nah: Kualli tekitl

source: Awesome!
nah: ¡tlawel inon!

source: Way to go!
nah: ¡Ijkinin mochiwa!

source: Wonderful!
nah: ¡melawak!

source: Nice work.
nah: Kualli tekitl

source: You did it!
nah: ¡Tijchij!

source: Be careful to use the correct finger to press each key. Look at the keyboard below if you need help remembering.
nah: Xijtlachilli keman tijtekiwiya makpilli, xijpacho tlan titlakualtilisSesenka machiopil. Xijtlachia itlan machiopil tlan tijneki palewilli ijkinon moelnamikis.

source: Try to type at the same speed, all the time. As you get more comfortable you can increase the speed a little.
nah: Xitlayejyeko titlajkuilos sanse ijiksan, nochipa. Tlan kualli tijmati titlapowa welis achi chikawak ijiksan titlapowas.

source: left little
nah: Ota pilmakpil

source: left ring
nah: Ota kopilmakpil

source: left middle
nah: Ota tlajkotipan

source: left index
nah: Ota Manextilmakpil

source: left thumb
nah: Ota Wexmakpil

source: right little
nah: Nejmak pilmakpil

source: right ring
nah: Nejmak kopilmskpil

source: right middle
nah: Nemajtlajkotipan

source: right index
nah: Nejmak manextilmakpil

source: right thumb
nah: Nejmak wexmakpil

source: key
nah: machiopil

source: Let's learn the new keys.
nah: Tijmatisen tijtekiwisen yankuik machiopil

source: Practice typing the keys you just learned.
nah: Xitlayejyeko titlajkuilos ika machiopil tlen tikonyékoj.

source: Now put the keys together into pairs.
nah: Aman xijnajnamik tlalli machiopil.

source: Time to type jumbles.
nah: Asik tonalli moijkuilos jumbles

source: Time to type real words.
nah: Asik tonalli moijkuilos nelnelia tlajtolli.

source: Hihowahyah! Ready to learn the secret of fast typing?
nah: Hihowahyah! ¡Aman kena timotlalijtok tijyekos kenijkatsan titlajkuilos chikawak?

source: Always use the correct finger to press each key!
nah: Moneki tijtekiwis makpilli tlen kinamiki machiopil

source: Now, place your hands on the keyboard just like the picture below.
nah: Aman, xijtlalli momax ipan iixko majmachiopil ken ixnesi ipan teipan ixkopintli.

source: When you're ready, press the SPACE bar with your thumb!
nah: Keman timotlalijtos, xijpacho ketsalli tlen wejkanowa wexmakpilli!

source: Good job! The SPACE bar is used to insert spaces between words.
nah: Kualli tekitl! Ketsalli wejkanowa motekiiwia keman mosentlapalos kakiwilli itsalan tlajtlajtolli.

source: Press the SPACE bar again with your thumb.
nah: Sempa xijpacho ketsalli wejkanowa ika wexmakpil

source: Now I'll teach you the second key, ENTER.
nah: Aman niamechnextilis tlen ompa machiopil, PANO

source: That's the big square key near your right little finger.
nah: Inon weyi machiopil nechka kampa nejmak pilmakpil.

source: Now, reach your little finger over and press ENTER.
nah: Aman, xijtlalli pilmakpil ipan PANO wan xijpacho

source: Great! When typing, the ENTER key is used to begin a new line.
nah: ¡Welkualli! Tijpachoj, machiotl PANO motekiwia keman mopewaltis se yankuik wasanilli.

source: Press the ENTER key again with your right little finger.
nah: Xijpacho machiopil PANO sempa ika nejmak pilmakpil.

source: Copy out the following text.
nah: Moixkopinas teipan nejtolli

source: left little finger
nah: Ota pilmakpil

source: left ring finger
nah: Ota wexmakpil

source: left middle finger
nah: Ota tlajkomakpil

source: left index finger
nah: Ota manextilmakpil

source: right little finger
nah: Nejmak pilmakpil

source: right ring finger
nah: Nejmak wexmakpil

source: right middle finger
nah: Nejmak tlajkomakpil

source: right index finger
nah: Nejmak manextilmakpil

source: <b>WPM:</b> %(wpm)d
nah: <b>ppm:</b> %(wpm)d

source: <b>Accuracy:</b> %(accuracy)d%%
nah: <b>Precisión:</b> %(accuracy)d%%

source: Press and hold the altgr key,
nah: Pacho xitlakuájto machiopli ALTGR

source: Press and hold the altgr and shift keys,
nah: Xijpacho wan xijpachojto majmachiotl ALTGR WAN SHFT,

source: Please change your keyboard settings and try this lesson again.
nah: Techtlapojpolwi xijpatla tlamantli tlen momamachiopil wan sempa xitlayejyeko ni powalli

source: Good job!
nah: ¡Kualli tekitl!

source: Nice work!
nah: ¡Kualli tekitl!

source: You need to practice this lesson more before moving on.
nah: Moneki nelia titlayejyekos, ijkinon tipanos ni amatlapowalli.

source: You almost got a medal! Next time, try not to make as many errors.
nah: ¡Kejwak! Kitlani se koskamachiotl! Teipan, xikita amo tlawel timokuapolos

source: You almost got a medal! Next time, try to type a little faster.
nah: ¡Kejwak kitlani se koskamachiotl! Teipan, ximoisiwilli titlajkuilos.

source: Next
nah: itokil

source: Previous
nah: achtowi

source: Start Lesson
nah: tokayolpewalistli

source: You earned a medal in this lesson! Advance to the next one by clicking the Next button.
nah: ¡Tijtlanki se koskatl ipan ni tlaixpowalli! Xisentokilli teipan[...] tijpachos ipan botón teipan.

source: No Medal Yet
nah: No conseguiste una medalla

source: Bronze Medal
nah: Medalla de Bronce

source: Silver Medal
nah: Medalla de Plata

source: Gold Medal
nah: Medalla de Oro

source: <span font_desc='Serif Bold Italic 28'>Certificate of Achievement</span>
nah: <span font_desc='Serif Bold Italic 28'>Certificado de Logro</span>

source: <span font_desc='Sans 16'>This certifies that</span>
nah: <span font_desc='Sans 16'>Esto certifica que</span>

source: <span font_desc='Sans 16'>earned a %(type)s medal in </span>
nah: <span font_desc='Sans 16'>obtuvo una medalla de %(type)s </span>

source: <span font_desc='Sans 16'>in <b><u><i>%(lesson)s</i></u></b></span>
nah: <span font_desc='Sans 16'>en <b><u><i>%(lesson)s</i></u></b></span>

source: <span font_desc='Sans 16'>on <b><u><i>%(date)s</i></u></b>.</span>
nah: <span font_desc='Sans 16'>en <b><u><i>%(date)s</i></u></b>.</span>

source: <b>Words Per Minute:</b> %(wpm)d
nah: <b>Palabras por minuto:</b> %(wpm)d

source: <b>SCORE:</b> %(score)d
nah: <b>PUNTUACIÓN:</b> %(score)d
