Repository: SudoSu-bham/typing-turtle-activity
Catalog: po/yo.po
Languages: yo

source: Typing Turtle
yo: Adaba

source: Need some help typing? Here you will learn the best way to hold your hands in order for you to become a faster typist!
yo: Nilo diẹ ninu awọn iranlọwọ titẹ? Nibiyi iwọ yoo kọ awọn ti o dara ju ona lati mu ọwọ rẹ ni ibere fun o lati di a yiyara typist!

source: Go Back
yo: Pada

source: You finished!
yo: O ti pari!

source: Your score was %(score)d.
yo: Rẹ dimegilio wà %(score)d.

source: You earned a %(type)s medal!
yo: Ti o mina a %(type)s medal!

source: Press the ENTER key to continue.
yo: Tẹ awọn bọtini tẹ lati tesiwaju.

source: SCORE: %d
yo: Dimegilio: %d

source: Type the words to pop the balloons!
yo: Tẹ awọn ọrọ lati agbejade awọn fọndugbẹ!

source: Edit Lessons
yo: Ṣatunkọ Eko

source: Name
yo: Orúkọ

source: Description
yo: Apejuwe

source: Type
yo: Iru

source: Import Lessons from Journal
yo: Gbe wọle Eko lati Journal

source: Export Lessons to Journal
yo: Okeere eko to Journal

source: Save Lessons to Activity
yo: Fi Eko to aṣayan iṣẹ-ṣiṣe

source: Text
yo: ọrọ

source: Balloon Game
yo: alafẹfẹ ere idaraya

source: Delete Lesson?
yo: Pa Ẹkọ?

source: Deleting the lesson will erase the lesson content.
yo: Npa awọn ẹkọ yoo nu awọn ẹkọ akoonu.

source: (Exported Lessons)
yo: (Okeere Eko)

source: Edit a Lesson
yo: Satunkọ a Ẹkọ

source: New keys
yo: New awọn bọtini

source: Known keys
yo: Mọ awọn bọtini

source: Length
yo: Ipari

source: Generate!
yo: Ina!

source: Edit Word List
yo: Ṣatunkọ Ọrọ List

source: Step #%d
yo: Igbese # %d

source: Keys
yo: Awọn bọtini

source: Words
yo: ọrọ

source: Instructions
yo: Plana

source: Accuracy
yo: Išedede

source: Score
yo: O wole

source: Lesson Details
yo: Ẹkọ Alaye

source: Normal Lesson
yo: Deede Ẹkọ

source: Options
yo: Awọn aṣayan

source: Allow Mistakes
yo: Gba Asise

source: Allow Backspace
yo: Gba Backspace

source: Automatic Lesson Generator
yo: Laifọwọyi Ẹkọ monomono

source: Medal Requirements
yo: Loôdun ibeere

source: Bronze
yo: Idẹ

source: Silver
yo: Fàdákà

source: Gold
yo: goolu

source: Type or paste words here, for the Automatic Lesson Generator. If empty, the dictionary will be used.
yo: Tẹ tabi lẹẹ ọrọ nibi, fun awọn Aifọwọyi Ẹkọ monomono. Ti o ba ti sofo, awọn itumọ yoo ṣee lo.

source: Well done!
yo: Daradara ṣe!

source: Good job.
yo: Iṣẹ to dara.

source: Awesome!
yo: Oniyi!

source: Way to go!
yo: Ọna lati lọ si!

source: Wonderful!
yo: Iyanu!

source: Nice work.
yo: Nice iṣẹ.

source: You did it!
yo: Ti o ṣe o!

source: Be careful to use the correct finger to press each key. Look at the keyboard below if you need help remembering.
yo: Jẹ ṣọra lati lo awọn ti o tọ ika lati tẹ bọtini kọọkan. Wo ni keyboard ni isalẹ ti o ba nilo iranlọwọ iranti.

source: Try to type at the same speed, all the time. As you get more comfortable you can increase the speed a little.
yo: Gbiyanju lati tẹ ni kanna iyara, gbogbo awọn akoko. Bi o ba gba diẹ itura ti o le mu iyara kekere kan.

source: left little
yo: osi kekere

source: left ring
yo: osi iwọn

source: left middle
yo: osi arin

source: left index
yo: osi Ìwé

source: left thumb
yo: osi atanpako

source: right little
yo: ọtun kekere

source: right ring
yo: ọtun iwọn

source: right middle
yo: ọtun arin

source: right index
yo: ọtun Ìwé

source: right thumb
yo: ọtun atanpako

source: and %s keys
yo: ati %s awọn bọtini

source: key
yo: bọtini

source: In this lesson, you will learn the %(keynames)s. Press the ENTER key when you are ready to begin!
yo: Ni yi ẹkọ, o yoo kọ awọn %(keynames)s. tẹ awọn tẹ bọtini nigba ti o ba wa setan lati bẹrẹ!

source: Let's learn the new keys.
yo: Jẹ ki ká kọ awọn titun bọtini.

source: Practice typing the keys you just learned.
yo: Niwa titẹ awọn bọtini ti o kan kẹkọọ.

source: Now put the keys together into pairs.
yo: Bayi fi awọn bọtini jọ sinu orisii.

source: Time to type jumbles.
yo: Akoko lati tẹ jumbles.

source: Time to type real words.
yo: Akoko lati tẹ gidi ọrọ.

source: Hihowahyah! Ready to learn the secret of fast typing?
yo: Hihowahyah! Setan lati ko awọn ikoko ti yara titẹ?

source: Always use the correct finger to press each key!
yo: Nigbagbogbo lo awọn ti o tọ ika lati tẹ bọtini kọọkan!

source: Now, place your hands on the keyboard just like the picture below.
yo: Bayi, gbe ọwọ rẹ lori keyboard kan bi awọn aworan ni isalẹ.

source: When you're ready, press the SPACE bar with your thumb!
yo: Nigba ti o ba setan, tẹ awọn aaye bar pẹlu rẹ atanpako!

source: Good job! The SPACE bar is used to insert spaces between words.
yo: Iṣẹ to dara! Awọn aaye bar ti lo lati fi alafo laarin awọn ọrọ.

source: Press the SPACE bar again with your thumb.
yo: O si tẹ awọn aaye bar lẹẹkansi pẹlu rẹ atanpako.

source: Now I'll teach you the second key, ENTER.
yo: Bayi Emi yoo kọ nyin keji bọtini, tẹ.

source: That's the big square key near your right little finger.
yo: Ti o ni awọn ńlá square bọtini nitosi ọtun rẹ kekere ika.

source: Now, reach your little finger over and press ENTER.
yo: Bayi, de ọdọ rẹ kekere ika lori ki o si tẹ Tẹ.

source: Great! When typing, the ENTER key is used to begin a new line.
yo: Nla! Nigba ti titẹ, awọn tẹ bọtini ti lo lati bẹrẹ titun kan ila.

source: Press the ENTER key again with your right little finger.
yo: Tẹ awọn bọtini tẹ lẹẹkansi pẹlu rẹ ọtun kekere ika.

source: Copy out the following text.
yo: Da awọn wọnyi jade ọrọ.

source: left little finger
yo: osi kekere ika

source: left ring finger
yo: osi iwọn ika

source: left middle finger
yo: osi arin ika

source: left index finger
yo: osi ika itọka

source: right little finger
yo: ọtun kekere ika

source: right ring finger
yo: ọtun iwọn ika

source: right middle finger
yo: ọtun arin ika

source: right index finger
yo: ọtun ika itọka

source: <b>Accuracy:</b> %(accuracy)d%%
yo: <b>Yiye:</b> %(accuracy)d%%

source: Press and hold the shift key with your %(finger)s,
yo: Tẹ ki o si mu awọn naficula bọtini pẹlu rẹ %(finger)s,

source: then press the %(letter)s key with your %(finger)s.
yo: ki o si tẹ awọn %(letter)s bọtini pẹlu rẹ %(finger)s.

source: Press and hold the altgr key,
yo: Tẹ ki o si mu awọn altgr bọtini,

source: Press and hold the altgr and shift keys,
yo: Tẹ ki o si mu awọn altgr ati naficula bọtini,

source: Press the %(letter)s key with your %(finger)s.
yo: Tẹ awọn %(letter)s bọtini pẹlu rẹ %(finger)s.

source: Uh oh! Your keyboard cannot type the letter '%s'.
yo: Hun oh! Rẹ keyboard ko le tẹ awọn lẹta ' %s '.

source: Please change your keyboard settings and try this lesson again.
yo: Jọwọ yi keyboard eto ki o si gbiyanju yi ẹkọ lẹẹkansi.

source: Good job!
yo: Iṣẹ to dara!

source: Nice work!
yo: Nice iṣẹ!

source: You finished the lesson in %(time)d seconds, with %(errors)d errors.
yo: Ti o pari awọn ẹkọ ni %(time)d aaya, pẹlu %(errors)d awọn aṣiṣe.

source: Your words per minute (WPM) was %(wpm)d, and your accuracy was %(accuracy)d%%.
yo: Ọrọ rẹ fun iseju (WPM) je %(wpm)d, ati awọn rẹ yiye wà %(accuracy)d%%.

source: You finished the lesson with %(errors)d errors.
yo: Ti o pari awọn ẹkọ pẹlu %(errors)d awọn aṣiṣe.

source: Your accuracy was %(accuracy)d%%.
yo: Rẹ yiye wà %(accuracy)d%%.

source: Congratulations! You earned a %(type)s medal!
yo: Oriire! Ti o mina a %(type)s medal!

source: You need to practice this lesson more before moving on.
yo: O nilo lati niwa yi ẹkọ diẹ ṣaaju ki o to gbigbe lori.

source: You almost got a medal! Next time, try not to make as many errors.
yo: O fere ni a medal! Next akoko, gbiyanju ko lati ṣe bi ọpọlọpọ awọn aṣiṣe.

source: You almost got a medal! Next time, try to type a little faster.
yo: O fere ni a medal! Next akoko, gbiyanju lati tẹ kekere kan yiyara.

source: Next
yo: Itele

source: Previous
yo: Ti tẹlẹ

source: Start Lesson
yo: Bẹrẹ Ẹkọ

source: You earned a medal in this lesson! Advance to the next one by clicking the Next button.
yo: O mina a loôdun yii! Advance si awọn nigbamii ti ọkan nipa tite Itele bọtini.

source: No Medal Yet
yo: Ko si Fadaka Ṣugbọn

source: Bronze Medal
yo: Idẹ Fadaka

source: Silver Medal
yo: Silver fadaka

source: Gold Medal
yo: Gold Fadaka

source: <span font_desc='Serif Bold Italic 28'>Certificate of Achievement</span>
yo: <span font_desc='Serif Bold italic 28'>aṣeyọri ti iwe-ẹri</span>

source: <span font_desc='Sans 16'>This certifies that</span>
yo: <span font_desc='Sans 16'>Yi ridaju pe</span>

source: <span font_desc='Sans 16'>earned a %(type)s medal in </span>
yo: <span font_desc='Sans 16'>jo'gun a %(type)s ẹbun ni</span>

source: <span font_desc='Sans 16'>in <b><u><i>%(lesson)s</i></u></b></span>
yo: <span font_desc='Sans 16'>ni<b><u><i>%(lesson)s</i></u></b></span>

source: <b>Words Per Minute:</b> %(wpm)d
yo: <b>ọrọ fun iseju:</b> %(wpm)d

source: <b>SCORE:</b> %(score)d
yo: <b>Dimegilio:</b>%(score)d
